Revit 2026 API

# PartMakerMethodToDivideVolumesAreElementsValidIntersectingReferences(Document, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreElementsValidIntersectingReferences(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function AreElementsValidIntersectingReferences (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AreElementsValidIntersectingReferences(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member AreElementsValidIntersectingReferences :
        document : Document *
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

PartMakerMethodToDivideVolumes Class

AreElementsValidIntersectingReferences Overload

Autodesk.Revit.DB Namespace